README_RU.md

# Table of Contents

1.  [Проекты "Школа 21"](#org1e37888)
    1.  [Язык C](#orgf2d2e9c)
        1.  [Базовые утилиты BASH ("cat" and "grep")](#org7583af6)
        2.  [Библиотека для работы со строками string.h](#org31433bb)
        3.  [Библиотека для математических вычислений math.h](#org3e51790)
        4.  [Библиотека для работы с числами большого порядка decimal](#org3323f63)
        5.  [Библиотека для работы с матрицами matrix](#orgd0fa335)
        6.  [Калькулятор математических выражений expression calculator](#orge43eb72)
        7.  [Программа для просмотра 3D моделей 3D viewer](#orgbf1f34b)
    2.  [DevOps](#org2a97e9d)
        1.  [Основы администрирования Linux link](#org9824790)
        2.  [Администрирование сетей в Linux link](#orga867245)
        3.  [Мониторинг Linux link](#org03360e0)
        4.  [Основы работы с Docker link](#org1555fba)
        5.  [Основы работы с CI/CD (gitlab-runner) link](#org77d3fa8)
    3.  [SQL](#org5316fd8)
        1.  [База данных обучающихся в Школе 21 Info21](#orgaa17e40)
        2.  [База данных клиентов различных магазинов и персональные предложения Retail Analytics](#org85a5c23)
    4.  [Язык C++](#org139c4f7)
        1.  [Библиотека для работы с матрицами matrix](#org540791f)
        2.  [Контейнеры стандартной библиотеки STL containers](#org7eb37fe)


<a id="org1e37888"></a>

# Проекты "Школа 21"

Следующие проекты были выполнены во время обучения в ["Школе 21"](https://21-school.ru)


<a id="orgf2d2e9c"></a>

## Язык C


<a id="org7583af6"></a>

### Базовые утилиты BASH (["cat"](./C/bash_utils/cat) and ["grep"](./C/bash_utils/grep))


<a id="org31433bb"></a>

### Библиотека для работы со строками [string.h](./C/string/)


<a id="org3e51790"></a>

### Библиотека для математических вычислений [math.h](./C/math/)


<a id="org3323f63"></a>

### Библиотека для работы с числами большого порядка [decimal](./C/decimal)


<a id="orgd0fa335"></a>

### Библиотека для работы с матрицами [matrix](./C/matrix)


<a id="orge43eb72"></a>

### Калькулятор математических выражений [expression calculator](./C/expression_calculator)


<a id="orgbf1f34b"></a>

### Программа для просмотра 3D моделей [3D viewer](./C/3DViewer)


<a id="org2a97e9d"></a>

## DevOps


<a id="org9824790"></a>

### Основы администрирования Linux [link](./DevOps/LinuxBasics/)


<a id="orga867245"></a>

### Администрирование сетей в Linux [link](./DevOps/LinuxNetworking)


<a id="org03360e0"></a>

### Мониторинг Linux [link](./DevOps/LinuxMonitoring)


<a id="org1555fba"></a>

### Основы работы с Docker [link](./DevOps/Docker)


<a id="org77d3fa8"></a>

### Основы работы с CI/CD (gitlab-runner) [link](./DevOps/CICD)


<a id="org5316fd8"></a>

## SQL


<a id="orgaa17e40"></a>

### База данных обучающихся в Школе 21 [Info21](./SQL/Info)


<a id="org85a5c23"></a>

### База данных клиентов различных магазинов и персональные предложения [Retail Analytics](./SQL/RetailAnalytics)


<a id="org139c4f7"></a>

## Язык C++


<a id="org540791f"></a>

### Библиотека для работы с матрицами [matrix](./CPP/matrix)


<a id="org7eb37fe"></a>

### Контейнеры стандартной библиотеки [STL containers](./CPP/containers)

